[
    {
        "id" : 1,
        "image" : "https://i.ibb.co/MkMGBP2/Unofficial-Java-Script-logo-2-svg.png",
        "title" : "What is javascript and how does work it",
        "description" : "Javascript  is the programming language of the web,  it's a single threated and non blocking high level programming language.its a interpreted programming language. by using javascript to make web page is more interactive",
        "date":"25-03-2024",
        "advantage" : "Feature of javascript",
        "feature" : [
            "Javascript is Asynchronous Programming with Promises and Async/Await",
            "Javascript is inherently Event-driven Programming it's allow to the user action which developer define the user action and asynchronous operation",
            
           "It's a prototype based programming language object in javascript created for prototype base language rather than class based language it's provide more power full code"
            
        ],
        "disAdvantage" : "Why We used javascript" ,
        "drawback" : [
            "Javascript is a cross platform support programming language which support all major web browser including chrome, safari,Edge, firefox it's ensure that javascript code can be run consistently run any web browser and operating system",
            
            "The main reason using javascript is Build a Client  Side web application using this language create a interactive and functionality on the client side of web application and it's also allow the developer manipulate the HTML DOM(document object model) and handle user interaction and dynamically update content without any reload the web page"
            
        ]
    },
    {
        "id" : 2,
        "image" : "https://i.ibb.co/tLjM2hy/nextjs7685-logowik-com.webp",
        "title" : "What is Next js and why we use Next.js",
        "description" : "Next.js is a React framework that provide server-side rendering, static site generation, and client-side rendering—all out of the box Developed by Vercel. by using next js create a high quality web application with the power of react component ",
        "date":"04-03-2024",
        "advantage" : "Feature of Next.js",
        "feature" : [
            "Using the Next.js you can render the react component on the serve side, if you used the react then you fetching the problem for SEO optimizing  but Next.js is provide SEO friendly site ",
            
            "Next.js provide you client site rendering(CSR) and pre-rendering,  in pre-rendering static HTML files that can be served to users instantly, for served the html page which not to needed and process on server side."
            
        ],
        "disAdvantage" : "Why We used Next.js" ,
        "drawback" : [
            "If You want to increase you site performance then Next js is provide server site rendering and static site generation, Next.js ensures blazing-fast page loads and superior performance, resulting in improved user satisfaction and search engine rankings.",
            
            "SEO-Friendly With its ability to render pages on the server side, Next.js produces HTML content that's easily crawlable by search engines, boosting discoverability and organic traffic"
            
        ]
    },
    {
        "id": 3,
        "title" : "Data Fetching with Tanstack Query",
        "image" : "https://i.ibb.co/YbRK0YJ/1686052318378.png",
        "description" : "TANStack query is easiest way to data fetching ,catching and update server state in your web application. The main purpose tanstack query is to simplify data fetching process. it' provided convenient and advance feature that helps you manage data fetching.",
        "date":"02-08-2023",
        "advantage" : "useQuery hooks",
        "feature" : [
            "tanstack provide useQuery() hook for data fetching. useQuery hooks get object (querykey, queryFn and retry).as initial value for fetching data. queryFn is a synchronous process. Request for api in this queryFn as like useEffect in axios or fetch"
            
            
            
        ],
        "disAdvantage" : "retry " ,
        "drawback" : [
            "If you used useEffect for data fetching if you have get server error or network error then you data may be loaded properly. in this case retry overcome this issue and get proper solution. retry value is automatically reload to trying get data from server site to client site."
            
        ]
    }
    
]