[
    
    {
        "name": "Baby Food(A Responsive project for Baby Food e-commerce) ",
        "description" : "This project aims to develop the features athe platform will deliver a seamless and immersive shopping experience, facilitating informed purchasing decisions and fostering long-term customer satisfaction among baby care enthusiasts.",
         "img": "https://i.ibb.co/vwDJ53L/screencapture-baby-food-eight-vercel-app-2024-05-05-18-27-07.png",
        "technology": [
            "Next Js",
            "Typescript",
            "Redux",
            "Framer motion",
            "tailwind",
            "React icons"
        ],
       
        "feature":[
            "User Can see all flash sale products(SSG)",
            "User can find the product by popular product category,",
            "Show trending product by using product rating",
            "Show all product on product page (SSG) user can find the product by using product category",
            "User can find their product using rating and price filter.",
            "user can see product details",
            "user can see all product on dashboard page in tabular form."
            
        ],
        "serverSite": "https://github.com/shukumar-542/baby-food-server",
        "clientSite": "https://github.com/shukumar-542/baby-food-frontend",
        "liveSite": "https://baby-food-eight.vercel.app/"
       
    },
    {
        "name": "Donative (A Responsive Winter clothes distribution )",
        "img": "https://i.ibb.co/J3gXtrT/screencapture-winter-clothe-distribution-client-eight-vercel-app-2024-05-05-18-41-52.png",
        "description": "The project aims to develop a comprehensive Distribution of Winter Clothes Management Platform using React, Redux for state management, RTK Query for efficient data fetching, and React Router DOM for navigation",
         "technology": [
            "Typescript",
            "Redux",
            "RTK Query",
            "lucide-react",
            "Framer motion",
            "sweetalert",
            "Node Js",
            "Express JS"
        ],
        "feature": [
            "User create their own account and donate winter clothes.",
            "Unauthorized user can not access dashboard.",
            "Unauthorized user see all clothes and details,",
            "authorized used can be add their product and see their own dashboard with information.and they can be able to update and delete their product.",
            "Enable users to switch between dark and light",
            "Show leaderboard to showcase the top donors who have made significant contributions",
            "community gratitude wall where users can post comments of appreciation for the support they've received during difficult times",
            "Donors will be able to post testimonials about the donation posts.",
            "Implement volunteers users can provide their information like their email, phone number"
        ],
        "serverSite": "https://github.com/shukumar-542/winter-clothe-distribution-backend",
        "clientSite": "https://github.com/shukumar-542/winter-clothe-distribution-client",
        "liveSite": "https://winter-clothe-distribution-client-eight.vercel.app/"
       
    },
    {
        "name": "SportZone(A full-stack responsive project for online sport course) ",
        "img": "https://i.ibb.co/rHVQgWS/ss2.png",
     
        "technology": [
            "tailwind",
            "DaisyUi",
            "headlessUi" ,
            "tanStackQuery" ,
            "react-hook-form",
            "swiper",
            "Stripe" ,
            "mongoDb",
            "JWT" ,
            "express"
        ],
       
        
        "description": "The project aim is provide online sport teaching.Implement dashboard for admin ,instructor and student depend on their role student select their class by clicking select button .",
        "serverSite": "https://github.com/shukumar-542/sport-zone-client",
        "clientSite": "https://github.com/shukumar-542/sport-zone-client",
        "liveSite": "https://sport-zone-ccbc8.web.app/"
        
    }
    
    
]